[
  {
    "voen_id": "1122334455",
    "main_info": {
      "name": "Pasha Bank LLC",
      "address": "123 Corporate Blvd, Baku",
      "phone": "+994 12 345 6789",
      "registration_date": "2005-04-12"
    },
    "fin": "7X2B9FQ",
    "owner": "Elchin Mammadov",
    "reason": "The company’s declared revenue has increased sharply without a corresponding rise in operational output. Financial statements suggest inflated turnovers, likely aimed at securing better financing terms or attracting investors. The discrepancy between growth in revenue and physical assets raises concerns about data reliability.",
    "score": 0.58
  },
  {
    "voen_id": "1122334456",
    "main_info": {
      "name": "BankTech Solutions",
      "address": "456 Innovation Ave, Baku",
      "phone": "+994 55 123 4567",
      "registration_date": "2012-09-18"
    },
    "fin": "8T9QLW2",
    "owner": "Leyla Aliyeva",
    "reason": "Numerous transactions were executed for the same amount across different counterparties on identical dates. This pattern is highly unusual in standard commercial activity and may indicate artificial movement of funds. The lack of contract references or invoices deepens the compliance concern.",
    "score": 0.52
  },
  {
    "voen_id": "1122334457",
    "main_info": {
      "name": "Global Trade Corp",
      "address": "789 Commerce St, Baku",
      "phone": "+994 70 987 6543",
      "registration_date": "2008-11-05"
    },
    "fin": "5H2KVRL",
    "owner": "Elchin Mammadov",
    "reason": "The company is involved in structured, round-tripping payments among its subsidiaries. These transactions appear designed to simulate revenue and boost financial ratios. External verification failed to identify real business purpose for the reported inflows.",
    "score": 0.45
  },
  {
    "voen_id": "1122334458",
    "main_info": {
      "name": "Future Vision LLC",
      "address": "321 Innovation Park, Baku",
      "phone": "+994 77 334 2211",
      "registration_date": "2015-06-20"
    },
    "fin": "3M8ZYWQ",
    "owner": "Rashad Huseynov",
    "reason": "Several fund movements originate from companies with no online or tax presence, often referred to as phantom entities. The pattern of payments is consistent with tactics used to clean or circulate undeclared capital. The lack of transaction memos or documented purpose heightens risk exposure.",
    "score": 0.40
  },
  {
    "voen_id": "6677889900",
    "main_info": {
      "name": "Techno Services",
      "address": "654 Digital Rd, Baku",
      "phone": "+994 50 555 1122",
      "registration_date": "2010-02-15"
    },
    "fin": "1V7LKZ8",
    "owner": "Kamran Karimov",
    "reason": "A cluster of same-value transactions was observed across accounts over short time windows, often within hours. No supporting documents or business justifications were provided upon inquiry. This may indicate laundering behavior or deliberate obfuscation of fund sources.",
    "score": 0.47
  },
  {
    "voen_id": "7788990011",
    "main_info": {
      "name": "Caspian Logistics",
      "address": "101 Port Ave, Baku",
      "phone": "+994 51 222 3344",
      "registration_date": "2017-03-10"
    },
    "fin": "4B6XNPT",
    "owner": "Rashad Huseynov",
    "reason": "Revenue growth in the past year is nearly triple that of the industry average with no matching capital investment or cost ratio shift. Discrepancies were also noted between inventory turnover and reported delivery volume. These indicators suggest likely overstatement of income.",
    "score": 0.50
  },
  {
    "voen_id": "8899001122",
    "main_info": {
      "name": "Smart Retailers",
      "address": "202 Market St, Baku",
      "phone": "+994 55 444 5566",
      "registration_date": "2018-08-22"
    },
    "fin": "9N3DLYK",
    "owner": "Nigar Guliyeva",
    "reason": "Forensic review showed repeated deposits from different entities within the same minute and with identical amounts. There is no indication of corresponding sales or operational triggers to explain this behavior. The activity profile is atypical and suggests transaction layering.",
    "score": 0.65
  },
  {
    "voen_id": "9900112233",
    "main_info": {
      "name": "Eco Energy Ltd",
      "address": "303 Green Blvd, Baku",
      "phone": "+994 70 666 7788",
      "registration_date": "2019-12-01"
    },
    "fin": "2J6YQWX",
    "owner": "Leyla Aliyeva",
    "reason": "Recent inflows originated from previously deregistered entities that are known for proxy funding. The transactions lack explanatory notes or matched operational expense entries. This creates high opacity in cash flows and reduces audit traceability.",
    "score": 0.49
  },
  {
    "voen_id": "2233445566",
    "main_info": {
      "name": "Urban Developers",
      "address": "404 City Center, Baku",
      "phone": "+994 12 888 9999",
      "registration_date": "2013-05-17"
    },
    "fin": "6W4RNTM",
    "owner": "Farid Abbasov",
    "reason": "A pattern of cyclical transactions between three affiliated companies has been identified, with no material services exchanged. These transactions appear to inflate revenue and manipulate liquidity ratios. This practice is commonly associated with deceptive financial positioning.",
    "score": 0.42
  },
  {
    "voen_id": "3344556677",
    "main_info": {
      "name": "MedTech Innovations",
      "address": "505 Health St, Baku",
      "phone": "+994 77 111 2233",
      "registration_date": "2021-01-30"
    },
    "fin": "0Q5UDFE",
    "owner": "Aysel Rahimova",
    "reason": "Despite being a newly incorporated entity, the company has already received large cash inflows from loosely documented sources. These transactions are followed by withdrawals or transfers to unrelated personal accounts. Such activity is a common indicator of potential fund routing for external beneficiaries.",
    "score": 0.55
  }
]
